capita-API_tests/src/test/java/data/DeleteByDocumentId_nodocid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:doc="https://www.capita.co.uk/TfL/docstore">
   <soapenv:Header/>
   <soapenv:Body>
      <doc:DeleteByDocumentId>
         <!--Optional:-->
      </doc:DeleteByDocumentId>
   </soapenv:Body>
</soapenv:Envelope>